#include <iostream>  
#include <string>   

int main() {
    std::string input;  // Переменная для хранения введенной строки
    int wordCount = 0;  // Переменная для подсчета слов
    bool inWord = false;  // Флаг, указывающий на то, находимся ли мы внутри слова

    // Запрашиваем у пользователя ввод строки
    std::cout << "Введите строку: ";
    std::getline(std::cin, input);  // Читаем строку с пробелами

    // Проходим по каждому символу во введенной строке
    for (char c : input) {
        // Если символ не пробел, значит мы находимся внутри слова
        if (c != ' ') {
            if (!inWord) {  // Если мы не были в слове, значит это начало нового слова
                inWord = true;  // Устанавливаем флаг в true
                wordCount++;  // Увеличиваем счетчик слов
            }
        } else {
            // Если символ пробел, значит мы вышли из слова
            inWord = false;  // Устанавливаем флаг в false
        }
    }

    // Выводим количество найденных слов
    std::cout << "Ответ: " << wordCount << std::endl;

    return 0;
}
